Assignments/4-Assignment/hw4.org
#+title: Assignment 4
#+HTML_MATHJAX: align: left indent: 2em
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../myStyle.css" />
#+OPTIONS: html-style:nil H:2 toc:2 todo:nil author:nil date:nil
#+HTML_LINK_HOME: ../../material.html
The following assignment is due *Thursday 2/20 by 8:00 PM*.  You'll
need to submit one crate on Gradescope called ~assign4~. The
expectation is that you will put everything is ~src/main.rs~ or
~src/lib.rs~.[fn:: If you want to look into separating your solution
into separate files, that's fine too.]

The theme of this assignment is "hacking the trait system."  Not all
patterns here are canonically "Rustian" but they will require us to
get creative with traits.

I've included some unit tests throughout the assignment. Rust makes it
/very/ easy to write tests, see the section in RPL on [[https://doc.rust-lang.org/stable/book/ch11-01-writing-tests.html][how to write
tests]] for more information.

* Monoids
Many data types have algebraic structure that can be captured by a
shared interface.  This is a common programming pattern in Haskell,
and makes appearances in the Rust standard library.  The goal of this
problem is to generalize this idea.

All algebraic structures we'll consider in this problem deal with a
binary operators. We'll abstract out this operator as part of a
generic trait:

#+begin_src rust
trait BinOp<T> {
    fn op(lhs: T, rhs: T) -> T;
}
#+end_src

A *semigroup* is a set $X$ together with a binary operation $\circ : X
\to X \to X$ which is associative.

It's possible to define a concatenation operation (~mconcat~) for any
semigroup, which takes a starting value and an iterator, and folds the
operator over the values of the iterator:

#+begin_src rust
  trait Semigroup<O> where
      O: BinOp<Self>,
      Self: Sized
  {
      fn mconcat<I: Iterator<Item=Self>>(start: Self, iter: I) -> Self {
	  let mut out = start;
	  for item in iter {
	      out = O::op(out, item)
	  }
	  out
      }
  }
#+end_src

This trait is generic over operators of a given type.  For technical
reasons, we also require types on which we define semigroups are ~Sized~.

A *monoid* is a set $X$ and an associative binary operator $\circ : X
\to X \to X$ and a designated unit element $u \in X$.

The tasks for this problem:

+ Define a monoid trait in analogy with the ~Semigroup~ trait, and so
  that ~Semigroup~ is a supertrait.
+ Implement these traits for ~i32~ and ~String~ so that the tests
  below.

Part of this problem is reverse engineering. What kind of thing should
~Add~ be?  What do you need to do in order to overload terms?  I would
recommend looking over section on [[https://doc.rust-lang.org/stable/book/ch19-03-advanced-traits.html][Advanced Traits]] in RPL for some
hints.  Note that one of the upshots of this pattern is that we can
have multiple algebraic traits for a given type with different
operators, and we can have a uniform convention for referring to kinds
of operators across types.

#+begin_src rust
  #[cfg(test)]
  mod tests {
      use super::*;

      #[test]
      fn mconcat_semi_add_i32() {
	  let expected = <i32 as Semigroup<Add>>::mconcat(10, vec![1, 2, 3, 4, 5].into_iter());
	  assert_eq!(expected, 25)
      }

      #[test]
      fn mconcat_semi_mul_i32() {
	  let expected = <i32 as Semigroup<Mul>>::mconcat(10, vec![1, 2, 3, 4, 5].into_iter());
	  assert_eq!(expected, 1200)
      }

      #[test]
      fn mconcat_mon_add_i32() {
	  let expected = <i32 as Monoid<Add>>::mconcat(vec![1, 2, 3, 4, 5].into_iter());
	  assert_eq!(expected, 15)
      }

      #[test]
      fn mconcat_mon_mul_i32() {
	  let expected = <i32 as Monoid<Mul>>::mconcat(vec![1, 2, 3, 4, 5].into_iter());
	  assert_eq!(expected, 120)
      }

      #[test]
      fn mconcat_semi_str() {
	  let s1 = String::from("abc");
	  let s2 = String::from("def");
	  let s3 = String::from("ghi");
	  let expected = <String as Semigroup<Add>>::mconcat(s1, vec![s2, s3].into_iter());
	  let actual = String::from("abcdefghi");
	  assert_eq!(expected, actual);
      }

      #[test]
      fn mconcat_mon_str() {
	  let s1 = String::from("abc");
	  let s2 = String::from("def");
	  let s3 = String::from("ghi");
	  let expected = <String as Monoid<Add>>::mconcat(vec![s1, s2, s3].into_iter());
	  let actual = String::from("abcdefghi");
	  assert_eq!(expected, actual)
      }
  }
#+end_src

