Assignments/4-Assignment/hw4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-14 Fri 18:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 4</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../myStyle.css" />

</head>
<body>
<div id="org-div-home-and-up"><a href="../../material.html">↩</a></div><div id="content" class="content">
<h1 class="title">Assignment 4</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org004ca33">1. Monoids</a></li>
<li><a href="#orge4b6bc1">2. Functors</a></li>
<li><a href="#org43dca86">3. Applicatives</a></li>
<li><a href="#org56d15bf">4. The Newtype Pattern</a></li>
</ul>
</div>
</div>
<p>
The following assignment is due <b>Thursday 2/20 by 8:00 PM</b>.  You'll
need to submit one crate on Gradescope called <code>assign4</code>. The
expectation is that you will put everything is <code>src/main.rs</code> or
<code>src/lib.rs</code>.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
The theme of this assignment is "hacking the trait system."  Not all
patterns here are canonically "Rustian" but they will require us to
get creative with traits.
</p>

<p>
I've included some unit tests throughout the assignment. Rust makes it
<i>very</i> easy to write tests, see the section in RPL on <a href="https://doc.rust-lang.org/stable/book/ch11-01-writing-tests.html">how to write
tests</a> for more information.
</p>

<div id="outline-container-org004ca33" class="outline-2">
<h2 id="org004ca33"><span class="section-number-2">1.</span> Monoids</h2>
<div class="outline-text-2" id="text-1">
<p>
Many data types have algebraic structure that can be captured by a
shared interface.  This is a common programming pattern in Haskell,
and makes appearances in the Rust standard library.  The goal of this
problem is to generalize this idea.
</p>

<p>
All algebraic structures we'll consider in this problem deal with a
binary operators. We'll abstract out this operator as part of a
generic trait:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">trait</span> <span style="color: #228b22;">BinOp</span>&lt;<span style="color: #228b22;">T</span>&gt; {
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">op</span>(<span style="color: #a0522d;">lhs</span>: <span style="color: #228b22;">T</span>, <span style="color: #a0522d;">rhs</span>: <span style="color: #228b22;">T</span>) -&gt; <span style="color: #228b22;">T</span>;
}
</pre>
</div>

<p>
A <b>semigroup</b> is a set \(X\) together with a binary operation \(\circ : X
\to X \to X\) which is associative.
</p>

<p>
It's possible to define a concatenation operation (<code>mconcat</code>) for any
semigroup, which takes a starting value and an iterator, and folds the
operator over the values of the iterator:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">trait</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">O</span>&gt; <span style="color: #a020f0;">where</span>
    <span style="color: #a0522d;">O</span>: <span style="color: #228b22;">BinOp</span>&lt;<span style="color: #228b22;">Self</span>&gt;,
    <span style="color: #a0522d;">Self</span>: <span style="color: #228b22;">Sized</span>
{
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat</span>&lt;<span style="color: #a0522d;">I</span>: <span style="color: #228b22;">Iterator</span>&lt;Item=Self&gt;&gt;(<span style="color: #a0522d;">start</span>: <span style="color: #228b22;">Self</span>, <span style="color: #a0522d;">iter</span>: <span style="color: #228b22;">I</span>) -&gt; <span style="color: #228b22;">Self</span> {
        <span style="color: #a020f0;">let</span> <span style="color: #a020f0;">mut</span> <span style="color: #a0522d;">out</span> = start;
        <span style="color: #a020f0;">for</span> <span style="color: #a0522d;">item</span> <span style="color: #a020f0;">in</span> iter {
            out = <span style="color: #228b22;">O</span>::op(out, item)
        }
        out
    }
}
</pre>
</div>

<p>
This trait is generic over operators of a given type.  For technical
reasons, we also require types on which we define semigroups are <code>Sized</code>.
</p>

<p>
A <b>monoid</b> is a set \(X\) and an associative binary operator \(\circ : X
\to X \to X\) and a designated unit element \(u \in X\).
</p>

<p>
The tasks for this problem:
</p>

<ul class="org-ul">
<li>Define a monoid trait in analogy with the <code>Semigroup</code> trait, and so
that <code>Semigroup</code> is a supertrait.</li>
<li>Implement these traits for <code>i32</code> and <code>String</code> so that the tests
below.</li>
</ul>

<p>
Part of this problem is reverse engineering. What kind of thing should
<code>Add</code> be?  What do you need to do in order to overload terms?  I would
recommend looking over section on <a href="https://doc.rust-lang.org/stable/book/ch19-03-advanced-traits.html">Advanced Traits</a> in RPL for some
hints.  Note that one of the upshots of this pattern is that we can
have multiple algebraic traits for a given type with different
operators, and we can have a uniform convention for referring to kinds
of operators across types.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #483d8b;">#[cfg(test)]</span>
<span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">tests</span> {
    <span style="color: #a020f0;">use</span> <span style="color: #a020f0;">super</span>::*;

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_semi_add_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = &lt;<span style="color: #228b22;">i32</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(10, <span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(expected, 25)
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_semi_mul_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = &lt;<span style="color: #228b22;">i32</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">Mul</span>&gt;&gt;::mconcat(10, <span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(expected, 1200)
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_mon_add_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = &lt;<span style="color: #228b22;">i32</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Monoid</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(<span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(expected, 15)
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_mon_mul_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = &lt;<span style="color: #228b22;">i32</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Monoid</span>&lt;<span style="color: #228b22;">Mul</span>&gt;&gt;::mconcat(<span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(expected, 120)
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_semi_str</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s1</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"abc"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s2</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"def"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s3</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"ghi"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = &lt;<span style="color: #228b22;">String</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(s1, <span style="color: #483d8b;">vec!</span>[s2, s3].into_iter());
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"abcdefghi"</span>);
        <span style="color: #483d8b;">assert_eq!</span>(expected, actual);
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_mon_str</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s1</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"abc"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s2</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"def"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s3</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"ghi"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = &lt;<span style="color: #228b22;">String</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Monoid</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(<span style="color: #483d8b;">vec!</span>[s1, s2, s3].into_iter());
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"abcdefghi"</span>);
        <span style="color: #483d8b;">assert_eq!</span>(expected, actual)
    }
}
</pre>
</div>
</div>
</div>
