Assignments/4-Assignment/hw4.org
* Functors

One of the deficits of traits as compared to [[https://en.wikipedia.org/wiki/Type_class][Type classes]] is the
inability to define traits on type constructors.  This means it's very
difficult to implement things like functors in Rust.  That said, it's
not impossible.  In this problem we'll be hacking functors into Rust.

In rough terms, a *functor* is a type constructor (formally, a type of
/kind/ $\texttt{Type} \to \texttt{Type}$) for which it's possible to
define a mapping function.  We tend to think of functors as "things
which hold other things" like ~Option~ or ~Vec~.  The mapping
operation allows you to apply a function to the "inner" thing without
disturbing the structure of the "outer" thing.  In Haskell, we define
the ~Functor~ type class as:

#+begin_src haskell
  class Functor (f :: Type -> Type) where
    fmap :: (a -> b) -> f a -> f b
#+end_src

Without getting into the Haskell of it all, the idea is that ~fmap~ is
a higher-order function that takes a function and "lifts" it to a
function to the level of the "outer" thing.  The benefit of this that
we can define functions against this interface, and derive code that
generalizes across a wide range of types.

Rust has a hard-coded implementation of [[https://doc.rust-lang.org/stable/std/option/enum.Option.html#method.map][map for ~Option~]]:
#+begin_src rust
  fn map<U, F>(self, f: F) -> Option<U> where
      F: FnOnce(T) -> U,
  {
      match self {
	  Some(x) => Some(f(x)),
	  None => None,
      }
  }
#+end_src

But there is no mechanism to generalize this in the Rust standard
library.  Again, the problem is that we can't define a trait for the
type constructor ~Option~, only for type ~Option<T>~ where ~T~ is a
concrete type or a type parameterized in the implementation.

We're going to get around this with a collection of tricks using
associated types.  Our first issue is that we can't refer to the "type
that a functor is holding" or "types which are the same up to what
they're holding."  We can get around this (in a circuitous way) by
defining for every type a trait which keeps track of these things as
associated types.

#+begin_src rust
  trait FunctorTypes {
      type Inner;
      type Outer<T>;
  }

  // Example for Option
  impl<T> FunctorTypes for Option<T> {
      type Inner = T;
      type Outer<S> = Option<S>;
  }
#+end_src

This is not terribly elegant, but its the kind of thing that could be
automated with a macro.  ~Inner~ will always match the type parameter
of the functor and ~Outer~ will match the functor up to parameter.
Note that we're using a fancy trick here: /associated types can be
generic./

We can then define our ~Functor~ trait in terms of these associated types:

#+begin_src rust
  trait Functor: FunctorTypes {
      fn fmap<T>(self, f: impl Fn(Self::Inner) -> T) -> Self::Outer<T>;
  }

  // Example for Option
  impl<S> Functor for Option<S> {
      fn fmap<T>(self, f: impl Fn(S) -> T) -> Option<T> {
	  match self {
	      None => None,
	      Some(x) => Some(f(x)),
	  }
      }
  }
#+end_src

The implementation is identical to the above standard library
implementation (modulo the weaker assumption on the type of the
closure) but the types in the trait itself are wonky. We're using the
~FunctorTypes~ trait to glean the information we can't get directly
from the given types.

*The tasks for this problem:* Add a default implementation of the
function ~funzip~ to ~Functor~. This function should take a functor
value with holding a pair and turn it into a pair of functor
values. The Rust standard library has a hard-coded version for
~Option~:

#+begin_src rust
  fn unzip(self) -> (Option<T>, Option<U>) {
	match self {
	    Some((a, b)) => (Some(a), Some(b)),
	    None => (None, None),
	}
  }
#+end_src

A couple hints:

+ Your implementation won't look like this, it will have
  to use ~fmap~ on ~self~
+ You will need to add a trait bound requiring that the underlying
  functor value is clonable (you'll see when you try to implement the
  function).
+ You'll also have to include a trait bound letting the compiler know
  that the inner type of ~Self~ is a pair.  Again, make sure to take a
  look at RPL on associated types to see how to specify an associated
  type.

Your implementation should be able to pass the following tests:

#+begin_src rust
  #[test]
  fn option_fmap() {
      let expected = Some(100).fmap(|x| x + 1);
      assert_eq!(expected, Some(101));
  }

  #[test]
  fn option_funzip() {
      let expected =  Some((vec![1, 2, 3], 4)).funzip();
      assert_eq!(expected.0, Some(vec![1, 2, 3]));
      assert_eq!(expected.1, Some(4))
  }

  #[test]
  fn option_functor_none() {
      let none : Option<(i32, i32)> = None;
      assert_eq!(none.fmap(|p| p.0 + p.1), None);
      assert_eq!(none.funzip(), (None, None))
  }
#+end_src

