Assignments/4-Assignment/hw4.html

<div id="outline-container-orge4b6bc1" class="outline-2">
<h2 id="orge4b6bc1"><span class="section-number-2">2.</span> Functors</h2>
<div class="outline-text-2" id="text-2">
<p>
One of the deficits of traits as compared to <a href="https://en.wikipedia.org/wiki/Type_class">Type classes</a> is the
inability to define traits on type constructors.  This means it's very
difficult to implement things like functors in Rust.  That said, it's
not impossible.  In this problem we'll be hacking functors into Rust.
</p>

<p>
In rough terms, a <b>functor</b> is a type constructor (formally, a type of
<i>kind</i> \(\texttt{Type} \to \texttt{Type}\)) for which it's possible to
define a mapping function.  We tend to think of functors as "things
which hold other things" like <code>Option</code> or <code>Vec</code>.  The mapping
operation allows you to apply a function to the "inner" thing without
disturbing the structure of the "outer" thing.  In Haskell, we define
the <code>Functor</code> type class as:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Functor</span> (f <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Type</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Type</span>) <span style="color: #a020f0;">where</span>
  fmap <span style="color: #a0522d;">::</span> (a <span style="color: #a0522d;">-&gt;</span> b) <span style="color: #a0522d;">-&gt;</span> f a <span style="color: #a0522d;">-&gt;</span> f b
</pre>
</div>

<p>
Without getting into the Haskell of it all, the idea is that <code>fmap</code> is
a higher-order function that takes a function and "lifts" it to a
function to the level of the "outer" thing.  The benefit of this that
we can define functions against this interface, and derive code that
generalizes across a wide range of types.
</p>

<p>
Rust has a hard-coded implementation of <a href="https://doc.rust-lang.org/stable/std/option/enum.Option.html#method.map">map for <code>Option</code></a>:
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">map</span>&lt;<span style="color: #228b22;">U</span>, <span style="color: #228b22;">F</span>&gt;(<span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">f</span>: <span style="color: #228b22;">F</span>) -&gt; <span style="color: #228b22;">Option</span>&lt;<span style="color: #228b22;">U</span>&gt; <span style="color: #a020f0;">where</span>
    <span style="color: #a0522d;">F</span>: <span style="color: #228b22;">FnOnce</span>(<span style="color: #228b22;">T</span>) -&gt; <span style="color: #228b22;">U</span>,
{
    <span style="color: #a020f0;">match</span> <span style="color: #a020f0;">self</span> {
        <span style="color: #228b22;">Some</span>(x) =&gt; <span style="color: #228b22;">Some</span>(f(x)),
        <span style="color: #228b22;">None</span> =&gt; <span style="color: #228b22;">None</span>,
    }
}
</pre>
</div>

<p>
But there is no mechanism to generalize this in the Rust standard
library.  Again, the problem is that we can't define a trait for the
type constructor <code>Option</code>, only for type <code>Option&lt;T&gt;</code> where <code>T</code> is a
concrete type or a type parameterized in the implementation.
</p>

<p>
We're going to get around this with a collection of tricks using
associated types.  Our first issue is that we can't refer to the "type
that a functor is holding" or "types which are the same up to what
they're holding."  We can get around this (in a circuitous way) by
defining for every type a trait which keeps track of these things as
associated types.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">trait</span> <span style="color: #228b22;">FunctorTypes</span> {
    <span style="color: #a020f0;">type</span> <span style="color: #228b22;">Inner</span>;
    <span style="color: #a020f0;">type</span> <span style="color: #228b22;">Outer</span>&lt;<span style="color: #228b22;">T</span>&gt;;
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">Example for Option</span>
<span style="color: #a020f0;">impl</span>&lt;<span style="color: #228b22;">T</span>&gt; <span style="color: #228b22;">FunctorTypes</span> <span style="color: #a020f0;">for</span> <span style="color: #228b22;">Option</span>&lt;<span style="color: #228b22;">T</span>&gt; {
    <span style="color: #a020f0;">type</span> <span style="color: #228b22;">Inner</span> = <span style="color: #228b22;">T</span>;
    <span style="color: #a020f0;">type</span> <span style="color: #228b22;">Outer</span>&lt;<span style="color: #228b22;">S</span>&gt; = <span style="color: #228b22;">Option</span>&lt;<span style="color: #228b22;">S</span>&gt;;
}
</pre>
</div>

<p>
This is not terribly elegant, but its the kind of thing that could be
automated with a macro.  <code>Inner</code> will always match the type parameter
of the functor and <code>Outer</code> will match the functor up to parameter.
Note that we're using a fancy trick here: <i>associated types can be
generic.</i>
</p>

<p>
We can then define our <code>Functor</code> trait in terms of these associated types:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">trait</span> <span style="color: #a0522d;">Functor</span>: <span style="color: #228b22;">FunctorTypes</span> {
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">fmap</span>&lt;<span style="color: #228b22;">T</span>&gt;(<span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">f</span>: <span style="color: #a020f0;">impl</span> <span style="color: #228b22;">Fn</span>(<span style="color: #228b22;">Self</span>::<span style="color: #228b22;">Inner</span>) -&gt; <span style="color: #228b22;">T</span>) -&gt; <span style="color: #228b22;">Self</span>::<span style="color: #228b22;">Outer</span>&lt;<span style="color: #228b22;">T</span>&gt;;
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">Example for Option</span>
<span style="color: #a020f0;">impl</span>&lt;<span style="color: #228b22;">S</span>&gt; <span style="color: #228b22;">Functor</span> <span style="color: #a020f0;">for</span> <span style="color: #228b22;">Option</span>&lt;<span style="color: #228b22;">S</span>&gt; {
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">fmap</span>&lt;<span style="color: #228b22;">T</span>&gt;(<span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">f</span>: <span style="color: #a020f0;">impl</span> <span style="color: #228b22;">Fn</span>(<span style="color: #228b22;">S</span>) -&gt; <span style="color: #228b22;">T</span>) -&gt; <span style="color: #228b22;">Option</span>&lt;<span style="color: #228b22;">T</span>&gt; {
        <span style="color: #a020f0;">match</span> <span style="color: #a020f0;">self</span> {
            <span style="color: #228b22;">None</span> =&gt; <span style="color: #228b22;">None</span>,
            <span style="color: #228b22;">Some</span>(x) =&gt; <span style="color: #228b22;">Some</span>(f(x)),
        }
    }
}
</pre>
</div>

<p>
The implementation is identical to the above standard library
implementation (modulo the weaker assumption on the type of the
closure) but the types in the trait itself are wonky. We're using the
<code>FunctorTypes</code> trait to glean the information we can't get directly
from the given types.
</p>

<p>
<b>The tasks for this problem:</b> Add a default implementation of the
function <code>funzip</code> to <code>Functor</code>. This function should take a functor
value with holding a pair and turn it into a pair of functor
values. The Rust standard library has a hard-coded version for
<code>Option</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">unzip</span>(<span style="color: #a020f0;">self</span>) -&gt; (<span style="color: #228b22;">Option</span>&lt;<span style="color: #228b22;">T</span>&gt;, <span style="color: #228b22;">Option</span>&lt;<span style="color: #228b22;">U</span>&gt;) {
      <span style="color: #a020f0;">match</span> <span style="color: #a020f0;">self</span> {
          <span style="color: #228b22;">Some</span>((a, b)) =&gt; (<span style="color: #228b22;">Some</span>(a), <span style="color: #228b22;">Some</span>(b)),
          <span style="color: #228b22;">None</span> =&gt; (<span style="color: #228b22;">None</span>, <span style="color: #228b22;">None</span>),
      }
}
</pre>
</div>

<p>
A couple hints:
</p>

<ul class="org-ul">
<li>Your implementation won't look like this, it will have
to use <code>fmap</code> on <code>self</code></li>
<li>You will need to add a trait bound requiring that the underlying
functor value is clonable (you'll see when you try to implement the
function).</li>
<li>You'll also have to include a trait bound letting the compiler know
that the inner type of <code>Self</code> is a pair.  Again, make sure to take a
look at RPL on associated types to see how to specify an associated
type.</li>
</ul>

<p>
Your implementation should be able to pass the following tests:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">option_fmap</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = <span style="color: #228b22;">Some</span>(100).fmap(|x| x + 1);
    <span style="color: #483d8b;">assert_eq!</span>(expected, <span style="color: #228b22;">Some</span>(101));
}

<span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">option_funzip</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> =  <span style="color: #228b22;">Some</span>((<span style="color: #483d8b;">vec!</span>[1, 2, 3], 4)).funzip();
    <span style="color: #483d8b;">assert_eq!</span>(expected.0, <span style="color: #228b22;">Some</span>(<span style="color: #483d8b;">vec!</span>[1, 2, 3]));
    <span style="color: #483d8b;">assert_eq!</span>(expected.1, <span style="color: #228b22;">Some</span>(4))
}

<span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">option_functor_none</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">none</span> : <span style="color: #228b22;">Option</span>&lt;(<span style="color: #228b22;">i32</span>, <span style="color: #228b22;">i32</span>)&gt; = <span style="color: #228b22;">None</span>;
    <span style="color: #483d8b;">assert_eq!</span>(none.fmap(|p| p.0 + p.1), <span style="color: #228b22;">None</span>);
    <span style="color: #483d8b;">assert_eq!</span>(none.funzip(), (<span style="color: #228b22;">None</span>, <span style="color: #228b22;">None</span>))
}
</pre>
</div>
</div>
</div>
