Assignments/4-Assignment/hw4.org
* Applicatives

Things can get a lot more complicated once we start generalizing past
functors.

An *applicative functor* is a functor together with a function ~pure~
that can "convert a thing into a held thing" and ~app~ which can
"apply a held function to a held thing." This gives us the following trait:

#+begin_src rust
  trait Applicative: Functor {
      fn pure(x: Self::Inner) -> Self;
      fn app<T, U>(self, ax: Self::Outer<T>) -> Self::Outer<U> where
	  T: Clone,
	  Self::Inner: Fn(T) -> U;
  }
#+end_src

Again, there's some weird stuff going on with the types.  We have a
trait bound which requires the inner type of ~Self~ to be a closure,
so that ~self~ is a "thing holding a function" and the input is a
"thing holding a ~T~" written with ~Outer~ associated type.

*The task for this problem:* Implement the ~Applicative~ trait for
~Option~, in analogy with the implementation of ~Functor~.

+ The ~pure~ function should take a value and wrap it in a ~Some~ constructor.
+ The ~app~ function should apply the held function to the held value
  if both are not ~None~.

Your implementation should pass the following tests:

#+begin_src rust
  #[test]
  fn option_pure() {
      assert_eq!(Option::pure(vec![1, 2, 3]), Some(vec![1, 2, 3]))
  }

  #[test]
  fn option_app() {
      let mut f = Some(|x| x + 1);
      assert_eq!(f.app(Some(10)), Some(11));
      assert_eq!(f.app(None), None);
      f = None;
      assert_eq!(f.app(Some(10)), None);
      assert_eq!(f.app(None), None);
  }
#+end_src

*Challenge (Optional):* Give a default implementation of a method ~app2~ which
can be applied when the inner value is a /Curried/ binary function,
and which "runs" ~app~ twice. It should pass the following test:

#+begin_src rust
  #[test]
  fn option_app2() {
      let f = Some(|x| move |y| x + y);
      assert_eq!(f.app2(Some(3), Some(4)), Some(7));
      assert_eq!(f.app2(Some(3), None), None);
      assert_eq!(f.app2(None, Some(3)), None);
      assert_eq!(f.app2(None, None), None);
  }
#+end_src

Getting the trait bounds right for ~app2~ is messy...

