Assignments/4-Assignment/hw4.html

<div id="outline-container-org43dca86" class="outline-2">
<h2 id="org43dca86"><span class="section-number-2">3.</span> Applicatives</h2>
<div class="outline-text-2" id="text-3">
<p>
Things can get a lot more complicated once we start generalizing past
functors.
</p>

<p>
An <b>applicative functor</b> is a functor together with a function <code>pure</code>
that can "convert a thing into a held thing" and <code>app</code> which can
"apply a held function to a held thing." This gives us the following trait:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">trait</span> <span style="color: #a0522d;">Applicative</span>: <span style="color: #228b22;">Functor</span> {
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">pure</span>(<span style="color: #a0522d;">x</span>: <span style="color: #228b22;">Self</span>::<span style="color: #228b22;">Inner</span>) -&gt; <span style="color: #228b22;">Self</span>;
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">app</span>&lt;<span style="color: #228b22;">T</span>, <span style="color: #228b22;">U</span>&gt;(<span style="color: #a020f0;">self</span>, <span style="color: #a0522d;">ax</span>: <span style="color: #228b22;">Self</span>::<span style="color: #228b22;">Outer</span>&lt;<span style="color: #228b22;">T</span>&gt;) -&gt; <span style="color: #228b22;">Self</span>::<span style="color: #228b22;">Outer</span>&lt;<span style="color: #228b22;">U</span>&gt; <span style="color: #a020f0;">where</span>
        <span style="color: #a0522d;">T</span>: <span style="color: #228b22;">Clone</span>,
        <span style="color: #228b22;">Self</span>::<span style="color: #a0522d;">Inner</span>: <span style="color: #228b22;">Fn</span>(<span style="color: #228b22;">T</span>) -&gt; <span style="color: #228b22;">U</span>;
}
</pre>
</div>

<p>
Again, there's some weird stuff going on with the types.  We have a
trait bound which requires the inner type of <code>Self</code> to be a closure,
so that <code>self</code> is a "thing holding a function" and the input is a
"thing holding a <code>T</code>" written with <code>Outer</code> associated type.
</p>

<p>
<b>The task for this problem:</b> Implement the <code>Applicative</code> trait for
<code>Option</code>, in analogy with the implementation of <code>Functor</code>.
</p>

<ul class="org-ul">
<li>The <code>pure</code> function should take a value and wrap it in a <code>Some</code> constructor.</li>
<li>The <code>app</code> function should apply the held function to the held value
if both are not <code>None</code>.</li>
</ul>

<p>
Your implementation should pass the following tests:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">option_pure</span>() {
    <span style="color: #483d8b;">assert_eq!</span>(<span style="color: #228b22;">Option</span>::pure(<span style="color: #483d8b;">vec!</span>[1, 2, 3]), <span style="color: #228b22;">Some</span>(<span style="color: #483d8b;">vec!</span>[1, 2, 3]))
}

<span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">option_app</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a020f0;">mut</span> <span style="color: #a0522d;">f</span> = <span style="color: #228b22;">Some</span>(|x| x + 1);
    <span style="color: #483d8b;">assert_eq!</span>(f.app(<span style="color: #228b22;">Some</span>(10)), <span style="color: #228b22;">Some</span>(11));
    <span style="color: #483d8b;">assert_eq!</span>(f.app(<span style="color: #228b22;">None</span>), <span style="color: #228b22;">None</span>);
    f = <span style="color: #228b22;">None</span>;
    <span style="color: #483d8b;">assert_eq!</span>(f.app(<span style="color: #228b22;">Some</span>(10)), <span style="color: #228b22;">None</span>);
    <span style="color: #483d8b;">assert_eq!</span>(f.app(<span style="color: #228b22;">None</span>), <span style="color: #228b22;">None</span>);
}
</pre>
</div>

<p>
<b>Challenge (Optional):</b> Give a default implementation of a method <code>app2</code> which
can be applied when the inner value is a <i>Curried</i> binary function,
and which "runs" <code>app</code> twice. It should pass the following test:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">option_app2</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">f</span> = <span style="color: #228b22;">Some</span>(|x| <span style="color: #a020f0;">move</span> |y| x + y);
    <span style="color: #483d8b;">assert_eq!</span>(f.app2(<span style="color: #228b22;">Some</span>(3), <span style="color: #228b22;">Some</span>(4)), <span style="color: #228b22;">Some</span>(7));
    <span style="color: #483d8b;">assert_eq!</span>(f.app2(<span style="color: #228b22;">Some</span>(3), <span style="color: #228b22;">None</span>), <span style="color: #228b22;">None</span>);
    <span style="color: #483d8b;">assert_eq!</span>(f.app2(<span style="color: #228b22;">None</span>, <span style="color: #228b22;">Some</span>(3)), <span style="color: #228b22;">None</span>);
    <span style="color: #483d8b;">assert_eq!</span>(f.app2(<span style="color: #228b22;">None</span>, <span style="color: #228b22;">None</span>), <span style="color: #228b22;">None</span>);
}
</pre>
</div>

<p>
Getting the trait bounds right for <code>app2</code> is messy&#x2026;
</p>
</div>
</div>
