Assignments/4-Assignment/hw4.org
* The Newtype Pattern

We can't define all these nice traits for vectors, but we can wrap
vectors in a new structure:

#+begin_src rust
#[derive(Clone, PartialEq, Debug)]
struct VVec<T>(Vec<T>);
#+end_src

You can call the struct whatever you want. You access the inner vector
using tuple accessor notation:

#+begin_src rust
  let v = VVec(vec![1, 2, 3]);
  assert_eq!(v.0[0], 1)
#+end_src

Working with these wrapped vectors requires some ugly boilerplate, but
at least now we can implement traits for ~VVec<T>~...

*The task for this problem:* Implement ~Semigroup~, ~Monoid~,
~Functor~ and ~Applicative~ for ~VVec~.

Some hints:

+ The concatenation operation on vectors is just vector concatenation.
+ The mapping operation on vectors applies the given closure to every
  element of the vector.
+ The pure operation creates a singleton.
+ The ~app~ operation is a bit complicated: given a vector of closures
  and a vector of values, map each function onto the vector of values
  and concatenate the results.

Your implementation should pass the following tests:

#+begin_src rust
  #[test]
  fn mconcat_semi() {
      let v1 = VVec(vec![1, 2, 3]);
      let v2 = VVec(vec![4, 5, 6]);
      let v3 = vec![v1, v2];
      let expected =<VVec<i32> as Semigroup<Add>>::mconcat(VVec(vec![0]), v3.into_iter());
      let actual = VVec(vec![0, 1, 2, 3, 4, 5, 6]);
      assert_eq!(expected, actual);
  }

  #[test]
  fn mconcat_mon() {
      let v1 = VVec(vec![1, 2, 3]);
      let v2 = VVec(vec![4, 5, 6]);
      let v3 = vec![v1, v2];
      let expected =<VVec<i32> as Monoid<Add>>::mconcat(v3.into_iter());
      let actual = VVec(vec![1, 2, 3, 4, 5, 6]);
      assert_eq!(expected, actual);
  }

  #[test]
  fn fmap_vvec() {
      let v = VVec(vec![1, 2, 3]);
      let expected = v.fmap(|x| x + 1);
      assert_eq!(expected, VVec(vec![2, 3, 4]))
  }

  #[test]
  fn funzip_vvec() {
      let v = VVec(vec![(1, 2), (3, 4), (5, 6)]);
      let expected = v.funzip();
      let v1 = VVec(vec![1, 3, 5]);
      let v2 = VVec(vec![2, 4, 6]);
      assert_eq!(expected, (v1, v2))
  }

  #[test]
  fn pure_vvec() {
      assert_eq!(VVec::pure(1), VVec(vec![1]));
  }

  #[test]
  fn app_vvec() {
      let v1 = VVec(vec![|x| x + 1, |x| x + 2]);
      let v2 = VVec(vec![1, 3, 5]);
      assert_eq!(v1.app(v2).0, vec![2, 4, 6, 3, 5, 7])
  }

#+end_src
