Assignments/4-Assignment/hw4.html

<div id="outline-container-org56d15bf" class="outline-2">
<h2 id="org56d15bf"><span class="section-number-2">4.</span> The Newtype Pattern</h2>
<div class="outline-text-2" id="text-4">
<p>
We can't define all these nice traits for vectors, but we can wrap
vectors in a new structure:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #483d8b;">#[derive(Clone, PartialEq, Debug)]</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">VVec</span>&lt;<span style="color: #228b22;">T</span>&gt;(<span style="color: #228b22;">Vec</span>&lt;<span style="color: #228b22;">T</span>&gt;);
</pre>
</div>

<p>
You can call the struct whatever you want. You access the inner vector
using tuple accessor notation:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[1, 2, 3]);
<span style="color: #483d8b;">assert_eq!</span>(v.0[0], 1)
</pre>
</div>

<p>
Working with these wrapped vectors requires some ugly boilerplate, but
at least now we can implement traits for <code>VVec&lt;T&gt;</code>&#x2026;
</p>

<p>
<b>The task for this problem:</b> Implement <code>Semigroup</code>, <code>Monoid</code>,
<code>Functor</code> and <code>Applicative</code> for <code>VVec</code>.
</p>

<p>
Some hints:
</p>

<ul class="org-ul">
<li>The concatenation operation on vectors is just vector concatenation.</li>
<li>The mapping operation on vectors applies the given closure to every
element of the vector.</li>
<li>The pure operation creates a singleton.</li>
<li>The <code>app</code> operation is a bit complicated: given a vector of closures
and a vector of values, map each function onto the vector of values
and concatenate the results.</li>
</ul>

<p>
Your implementation should pass the following tests:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_semi</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v1</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[1, 2, 3]);
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v2</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[4, 5, 6]);
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v3</span> = <span style="color: #483d8b;">vec!</span>[v1, v2];
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> =&lt;<span style="color: #228b22;">VVec</span>&lt;<span style="color: #228b22;">i32</span>&gt; <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(<span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[0]), v3.into_iter());
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[0, 1, 2, 3, 4, 5, 6]);
    <span style="color: #483d8b;">assert_eq!</span>(expected, actual);
}

<span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_mon</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v1</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[1, 2, 3]);
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v2</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[4, 5, 6]);
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v3</span> = <span style="color: #483d8b;">vec!</span>[v1, v2];
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> =&lt;<span style="color: #228b22;">VVec</span>&lt;<span style="color: #228b22;">i32</span>&gt; <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Monoid</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(v3.into_iter());
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5, 6]);
    <span style="color: #483d8b;">assert_eq!</span>(expected, actual);
}

<span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">fmap_vvec</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[1, 2, 3]);
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = v.fmap(|x| x + 1);
    <span style="color: #483d8b;">assert_eq!</span>(expected, <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[2, 3, 4]))
}

<span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">funzip_vvec</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[(1, 2), (3, 4), (5, 6)]);
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = v.funzip();
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v1</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[1, 3, 5]);
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v2</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[2, 4, 6]);
    <span style="color: #483d8b;">assert_eq!</span>(expected, (v1, v2))
}

<span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">pure_vvec</span>() {
    <span style="color: #483d8b;">assert_eq!</span>(<span style="color: #228b22;">VVec</span>::pure(1), <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[1]));
}

<span style="color: #483d8b;">#[test]</span>
<span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">app_vvec</span>() {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v1</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[|x| x + 1, |x| x + 2]);
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">v2</span> = <span style="color: #228b22;">VVec</span>(<span style="color: #483d8b;">vec!</span>[1, 3, 5]);
    <span style="color: #483d8b;">assert_eq!</span>(v1.app(v2).0, <span style="color: #483d8b;">vec!</span>[2, 4, 6, 3, 5, 7])
}

</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">If you want to look into separating your solution
into separate files, that's fine too.</p></div></div>


</div>
</div></div>
</body>
</html>
